benchmark_results.txt
========================================
 C++ LOAD BALANCER BENCHMARK
========================================

Test 1: 1 thread, 10 connections, 10 seconds
----------------------------------------
Running 10s test @ http://127.0.0.1:8080/
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    79.64ms  191.52ms   1.02s    88.45%
    Req/Sec     4.49k     1.46k    7.18k    73.56%
  39673 requests in 10.02s, 5.98MB read
Requests/sec:   3961.14
Transfer/sec:    611.19KB

Test 2: 2 threads, 50 connections, 10 seconds
----------------------------------------
Running 10s test @ http://127.0.0.1:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   187.76ms  324.72ms   1.85s    83.20%
    Req/Sec     2.05k     1.28k    5.59k    62.05%
  34742 requests in 9.59s, 5.23MB read
  Socket errors: connect 0, read 0, write 0, timeout 68
Requests/sec:   3624.28
Transfer/sec:    559.22KB

Test 3: 4 threads, 100 connections, 10 seconds
----------------------------------------
Running 10s test @ http://127.0.0.1:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   126.51ms  287.18ms   1.87s    86.40%
    Req/Sec     1.32k     0.88k    4.23k    67.16%
  44965 requests in 10.02s, 6.78MB read
  Socket errors: connect 0, read 0, write 0, timeout 19
Requests/sec:   4488.37
Transfer/sec:    692.54KB

Test 4: 4 threads, 200 connections, 10 seconds
----------------------------------------
Running 10s test @ http://127.0.0.1:8080/
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    87.59ms  258.63ms   1.91s    90.16%
    Req/Sec     1.42k     1.24k    5.64k    74.32%
  41861 requests in 10.03s, 6.31MB read
  Socket errors: connect 0, read 0, write 0, timeout 35
Requests/sec:   4173.23
Transfer/sec:    643.92KB

========================================
 BENCHMARK COMPLETE
========================================